{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "UObjectCategory",
			"Children": [
				{
					"Source": {
						"Text": "ActorX"
					},
					"Translation": {
						"Text": "ActorX"
					},
					"Key": "ActorX"
				},
				{
					"Source": {
						"Text": "Import Options"
					},
					"Translation": {
						"Text": "Import Options"
					},
					"Key": "Import Options"
				},
				{
					"Source": {
						"Text": "Orientation"
					},
					"Translation": {
						"Text": "Orientation"
					},
					"Key": "Orientation"
				},
				{
					"Source": {
						"Text": "Target"
					},
					"Translation": {
						"Text": "Target"
					},
					"Key": "Target"
				}
			]
		},
		{
			"Namespace": "UObjectDisplayNames",
			"Children": [
				{
					"Source": {
						"Text": "+X"
					},
					"Translation": {
						"Text": "+X"
					},
					"Key": "EActorXForwardAxis.PositiveX"
				},
				{
					"Source": {
						"Text": "+Y"
					},
					"Translation": {
						"Text": "+Y"
					},
					"Key": "EActorXForwardAxis.PositiveY"
				},
				{
					"Source": {
						"Text": "-X"
					},
					"Translation": {
						"Text": "-X"
					},
					"Key": "EActorXForwardAxis.NegativeX"
				},
				{
					"Source": {
						"Text": "-Y"
					},
					"Translation": {
						"Text": "-Y"
					},
					"Key": "EActorXForwardAxis.NegativeY"
				},
				{
					"Source": {
						"Text": "Actor XImport Settings"
					},
					"Translation": {
						"Text": "Actor XImport Settings"
					},
					"Key": "ActorXImportSettings"
				},
				{
					"Source": {
						"Text": "Actor XMesh Import Data"
					},
					"Translation": {
						"Text": "Actor XMesh Import Data"
					},
					"Key": "ActorXMeshImportData"
				},
				{
					"Source": {
						"Text": "Actor XOrientation"
					},
					"Translation": {
						"Text": "Actor XOrientation"
					},
					"Key": "ActorXOrientation"
				},
				{
					"Source": {
						"Text": "Auto Detect (Recommended)"
					},
					"Translation": {
						"Text": "Auto Detect (Recommended)"
					},
					"Key": "EPsaSource.Auto"
				},
				{
					"Source": {
						"Text": "Destination"
					},
					"Translation": {
						"Text": "Destination"
					},
					"Key": "PsaImportSettings:Destination"
				},
				{
					"Source": {
						"Text": "EActor XForward Axis MAX"
					},
					"Translation": {
						"Text": "EActor XForward Axis MAX"
					},
					"Key": "EActorXForwardAxis.EActorXForwardAxis_MAX"
				},
				{
					"Source": {
						"Text": "EPsa Source MAX"
					},
					"Translation": {
						"Text": "EPsa Source MAX"
					},
					"Key": "EPsaSource.EPsaSource_MAX"
				},
				{
					"Source": {
						"Text": "FModel / CUE4Parse"
					},
					"Translation": {
						"Text": "FModel / CUE4Parse"
					},
					"Key": "EPsaSource.FModel"
				},
				{
					"Source": {
						"Text": "Import Orientation"
					},
					"Translation": {
						"Text": "Import Orientation"
					},
					"Key": "ActorXMeshImportData:Orientation"
				},
				{
					"Source": {
						"Text": "Orientation"
					},
					"Translation": {
						"Text": "Orientation"
					},
					"Key": "ActorXImportSettings:Orientation"
				},
				{
					"Source": {
						"Text": "PSA Source"
					},
					"Translation": {
						"Text": "PSA Source"
					},
					"Key": "PsaImportSettings:Source"
				},
				{
					"Source": {
						"Text": "Psa Import Settings"
					},
					"Translation": {
						"Text": "Psa Import Settings"
					},
					"Key": "PsaImportSettings"
				},
				{
					"Source": {
						"Text": "Repair Invalid Keys"
					},
					"Translation": {
						"Text": "Repair Invalid Keys"
					},
					"Key": "PsaImportSettings:bRepairInvalidKeys"
				},
				{
					"Source": {
						"Text": "Replace Existing Animations"
					},
					"Translation": {
						"Text": "Replace Existing Animations"
					},
					"Key": "PsaImportSettings:bReplaceExisting"
				},
				{
					"Source": {
						"Text": "Source Forward"
					},
					"Translation": {
						"Text": "Source Forward"
					},
					"Key": "ActorXOrientation:SourceForward"
				},
				{
					"Source": {
						"Text": "Target Forward"
					},
					"Translation": {
						"Text": "Target Forward"
					},
					"Key": "ActorXOrientation:TargetForward"
				},
				{
					"Source": {
						"Text": "Target Skeletal Mesh"
					},
					"Translation": {
						"Text": "Target Skeletal Mesh"
					},
					"Key": "PsaImportSettings:TargetMesh"
				},
				{
					"Source": {
						"Text": "Translation Scale"
					},
					"Translation": {
						"Text": "Translation Scale"
					},
					"Key": "PsaImportSettings:TranslationScale"
				},
				{
					"Source": {
						"Text": "UEViewer / Legacy ActorX"
					},
					"Translation": {
						"Text": "UEViewer / Legacy ActorX"
					},
					"Key": "EPsaSource.ActorX"
				},
				{
					"Source": {
						"Text": "Use Mesh Reference Scale"
					},
					"Translation": {
						"Text": "Use Mesh Reference Scale"
					},
					"Key": "PsaImportSettings:bUseReferenceScale"
				}
			]
		},
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source": {
						"Text": "Default: 1. Adjust only if the FBX mesh uses different units."
					},
					"Translation": {
						"Text": "Default: 1. Adjust only if the FBX mesh uses different units."
					},
					"Key": "PsaImportSettings:TranslationScale"
				},
				{
					"Source": {
						"Text": "Detect UEViewer metadata per file, otherwise use FModel. You can also choose the source manually. When UEViewer provides no real hierarchy, match bones by name and use the target mesh hierarchy."
					},
					"Translation": {
						"Text": "Detect UEViewer metadata per file, otherwise use FModel. You can also choose the source manually. When UEViewer provides no real hierarchy, match bones by name and use the target mesh hierarchy."
					},
					"Key": "PsaImportSettings:Source"
				},
				{
					"Source": {
						"Text": "Forward direction after importing into UE. Rotate around UE +Z, applying the same transform to the mesh and bones."
					},
					"Translation": {
						"Text": "Forward direction after importing into UE. Rotate around UE +Z, applying the same transform to the mesh and bones."
					},
					"Key": "ActorXOrientation:TargetForward"
				},
				{
					"Source": {
						"Text": "Off by default. Ignore PSA animation scale and use each target mesh bone's reference scale, keeping position and rotation. Useful for unusually stretched animations; intentional scale effects are also ignored."
					},
					"Translation": {
						"Text": "Off by default. Ignore PSA animation scale and use each target mesh bone's reference scale, keeping position and rotation. Useful for unusually stretched animations; intentional scale effects are also ignored."
					},
					"Key": "PsaImportSettings:bUseReferenceScale"
				},
				{
					"Source": {
						"Text": "Off by default. Repair keys per animation and bone: interpolate interior gaps; copy the nearest valid frame at either end; fail if the entire track is invalid. Position, rotation, and scale are repaired together. Repairs estimate poses and do not recover the original motion."
					},
					"Translation": {
						"Text": "Off by default. Repair keys per animation and bone: interpolate interior gaps; copy the nearest valid frame at either end; fail if the entire track is invalid. Position, rotation, and scale are repaired together. Repairs estimate poses and do not recover the original motion."
					},
					"Key": "PsaImportSettings:bRepairInvalidKeys"
				},
				{
					"Source": {
						"Text": "Off by default: generate a unique name. When enabled, overwrite only animation sequences using the same Skeleton."
					},
					"Translation": {
						"Text": "Off by default: generate a unique name. When enabled, overwrite only animation sequences using the same Skeleton."
					},
					"Key": "PsaImportSettings:bReplaceExisting"
				},
				{
					"Source": {
						"Text": "Select a Skeletal Mesh imported from PSK or FBX. Animations will use its Skeleton."
					},
					"Translation": {
						"Text": "Select a Skeletal Mesh imported from PSK or FBX. Animations will use its Skeleton."
					},
					"Key": "PsaImportSettings:TargetMesh"
				},
				{
					"Source": {
						"Text": "Serialized with the mesh so animations imported in a later editor session use the same basis."
					},
					"Translation": {
						"Text": "Serialized with the mesh so animations imported in a later editor session use the same basis."
					},
					"Key": "ActorXMeshImportData"
				},
				{
					"Source": {
						"Text": "Source forward direction after restoring UE coordinates. The girl023 sample uses +X. Use the same settings for every body part of a character."
					},
					"Translation": {
						"Text": "Source forward direction after restoring UE coordinates. The girl023 sample uses +X. Use the same settings for every body part of a character."
					},
					"Key": "ActorXOrientation:SourceForward"
				},
				{
					"Source": {
						"Text": "UE content path, such as /Game/Characters/Animations."
					},
					"Translation": {
						"Text": "UE content path, such as /Game/Characters/Animations."
					},
					"Key": "PsaImportSettings:Destination"
				}
			]
		},
		{
			"Namespace": "UnrealPSKPSA",
			"Children": [
				{
					"Source": {
						"Text": "(auto-detected)"
					},
					"Translation": {
						"Text": "(auto-detected)"
					},
					"Key": "AutomaticSource"
				},
				{
					"Source": {
						"Text": "(manual)"
					},
					"Translation": {
						"Text": "(manual)"
					},
					"Key": "ManualSource"
				},
				{
					"Source": {
						"Text": "A PSK/PSKX skeletal mesh requires both bones and skin weights. Incomplete data cannot be imported as a skeletal mesh."
					},
					"Translation": {
						"Text": "A PSK/PSKX skeletal mesh requires both bones and skin weights. Incomplete data cannot be imported as a skeletal mesh."
					},
					"Key": "MissingSkinData"
				},
				{
					"Source": {
						"Text": "Add from Folder…"
					},
					"Translation": {
						"Text": "Add from Folder…"
					},
					"Key": "ChooseFolder"
				},
				{
					"Source": {
						"Text": "Animation key {0} contains an invalid position or rotation (such as a zero quaternion). Enable \"Repair Invalid Keys\" to attempt repair, or export it again."
					},
					"Translation": {
						"Text": "Animation key {0} contains an invalid position or rotation (such as a zero quaternion). Enable \"Repair Invalid Keys\" to attempt repair, or export it again."
					},
					"Key": "PsaInvalidPose"
				},
				{
					"Source": {
						"Text": "Animation key {0} has an invalid time. Export it again."
					},
					"Translation": {
						"Text": "Animation key {0} has an invalid time. Export it again."
					},
					"Key": "PsaInvalidKeyTime"
				},
				{
					"Source": {
						"Text": "Animation orientation: inherit the target mesh ({0}). To change it, import the mesh with the new orientation, then import the animation again."
					},
					"Translation": {
						"Text": "Animation orientation: inherit the target mesh ({0}). To change it, import the mesh with the new orientation, then import the animation again."
					},
					"Key": "OrientationInherited"
				},
				{
					"Source": {
						"Text": "Animation orientation: select a target mesh to inherit its orientation."
					},
					"Translation": {
						"Text": "Animation orientation: select a target mesh to inherit its orientation."
					},
					"Key": "OrientationNoMesh"
				},
				{
					"Source": {
						"Text": "Animation orientation: this mesh has no ActorX orientation metadata; keep its original coordinates. To change an older mesh to +Y, import the PSK again and choose the target direction."
					},
					"Translation": {
						"Text": "Animation orientation: this mesh has no ActorX orientation metadata; keep its original coordinates. To change an older mesh to +Y, import the PSK again and choose the target direction."
					},
					"Key": "OrientationNoMetadata"
				},
				{
					"Source": {
						"Text": "Animation {0}, bone {1} has no valid frames to use for repair."
					},
					"Translation": {
						"Text": "Animation {0}, bone {1} has no valid frames to use for repair."
					},
					"Key": "NoRepairAnchor"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "Cancel"
					},
					"Key": "Cancel"
				},
				{
					"Source": {
						"Text": "Cannot import '{0}': {1}"
					},
					"Translation": {
						"Text": "Cannot import '{0}': {1}"
					},
					"Key": "PskImportError"
				},
				{
					"Source": {
						"Text": "Cannot read file."
					},
					"Translation": {
						"Text": "Cannot read file."
					},
					"Key": "PskReadFailed"
				},
				{
					"Source": {
						"Text": "Cannot read the PSA file."
					},
					"Translation": {
						"Text": "Cannot read the PSA file."
					},
					"Key": "PsaReadFailed"
				},
				{
					"Source": {
						"Text": "Choose PSA Animations"
					},
					"Translation": {
						"Text": "Choose PSA Animations"
					},
					"Key": "ChooseFilesTitle"
				},
				{
					"Source": {
						"Text": "Choose PSA Files…"
					},
					"Translation": {
						"Text": "Choose PSA Files…"
					},
					"Key": "ChooseFiles"
				},
				{
					"Source": {
						"Text": "Choose a PSA Folder (Current Directory Only)"
					},
					"Translation": {
						"Text": "Choose a PSA Folder (Current Directory Only)"
					},
					"Key": "ChooseFolderTitle"
				},
				{
					"Source": {
						"Text": "Choose a skeletal mesh and import one or more PSA animation files."
					},
					"Translation": {
						"Text": "Choose a skeletal mesh and import one or more PSA animation files."
					},
					"Key": "ImportMenuTooltip"
				},
				{
					"Source": {
						"Text": "Chunk {0} has record size {1}; expected {2}."
					},
					"Translation": {
						"Text": "Chunk {0} has record size {1}; expected {2}."
					},
					"Key": "PskRecordSize"
				},
				{
					"Source": {
						"Text": "Clear"
					},
					"Translation": {
						"Text": "Clear"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "Destination must be a valid content path, such as /Game/Animations."
					},
					"Translation": {
						"Text": "Destination must be a valid content path, such as /Game/Animations."
					},
					"Key": "InvalidDestination"
				},
				{
					"Source": {
						"Text": "Error"
					},
					"Translation": {
						"Text": "Error"
					},
					"Key": "LogError"
				},
				{
					"Source": {
						"Text": "Extra UV count does not match wedges."
					},
					"Translation": {
						"Text": "Extra UV count does not match wedges."
					},
					"Key": "PskExtraUVCount"
				},
				{
					"Source": {
						"Text": "Failed to create skeletal mesh description for {0}"
					},
					"Translation": {
						"Text": "Failed to create skeletal mesh description for {0}"
					},
					"Key": "PskMeshDescriptionFailed"
				},
				{
					"Source": {
						"Text": "Ignored {0} source bones absent from the target mesh."
					},
					"Translation": {
						"Text": "Ignored {0} source bones absent from the target mesh."
					},
					"Key": "UnmatchedSourceBones"
				},
				{
					"Source": {
						"Text": "Import"
					},
					"Translation": {
						"Text": "Import"
					},
					"Key": "Import"
				},
				{
					"Source": {
						"Text": "Import Animations"
					},
					"Translation": {
						"Text": "Import Animations"
					},
					"Key": "ImportAnimations"
				},
				{
					"Source": {
						"Text": "Import PSA Animations"
					},
					"Translation": {
						"Text": "Import PSA Animations"
					},
					"Key": "PanelTitle"
				},
				{
					"Source": {
						"Text": "Import PSA Animation…"
					},
					"Translation": {
						"Text": "Import PSA Animation…"
					},
					"Key": "ImportMenu"
				},
				{
					"Source": {
						"Text": "Import PSA animation"
					},
					"Translation": {
						"Text": "Import PSA animation"
					},
					"Key": "ImportPSA"
				},
				{
					"Source": {
						"Text": "Import PSA animations using this skeletal mesh's Skeleton."
					},
					"Translation": {
						"Text": "Import PSA animations using this skeletal mesh's Skeleton."
					},
					"Key": "MeshMenuTooltip"
				},
				{
					"Source": {
						"Text": "Import canceled; {0} files were not processed."
					},
					"Translation": {
						"Text": "Import canceled; {0} files were not processed."
					},
					"Key": "ImportCanceled"
				},
				{
					"Source": {
						"Text": "Import complete."
					},
					"Translation": {
						"Text": "Import complete."
					},
					"Key": "ImportComplete"
				},
				{
					"Source": {
						"Text": "Importing PSA animations"
					},
					"Translation": {
						"Text": "Importing PSA animations"
					},
					"Key": "ImportProgress"
				},
				{
					"Source": {
						"Text": "Incompatible bone hierarchy. Use the matching source mesh or retarget the animation first:\n"
					},
					"Translation": {
						"Text": "Incompatible bone hierarchy. Use the matching source mesh or retarget the animation first:\n"
					},
					"Key": "HierarchyMismatch"
				},
				{
					"Source": {
						"Text": "Invalid PSA file: missing ANIMHEAD."
					},
					"Translation": {
						"Text": "Invalid PSA file: missing ANIMHEAD."
					},
					"Key": "PsaMissingSignature"
				},
				{
					"Source": {
						"Text": "Invalid bone name, hierarchy or transform."
					},
					"Translation": {
						"Text": "Invalid bone name, hierarchy or transform."
					},
					"Key": "PskInvalidBone"
				},
				{
					"Source": {
						"Text": "Invalid face material index."
					},
					"Translation": {
						"Text": "Invalid face material index."
					},
					"Key": "PskInvalidMaterial"
				},
				{
					"Source": {
						"Text": "Invalid face wedge index."
					},
					"Translation": {
						"Text": "Invalid face wedge index."
					},
					"Key": "PskInvalidFaceWedge"
				},
				{
					"Source": {
						"Text": "Invalid keys lie outside the animation ranges; no repair anchors can be determined."
					},
					"Translation": {
						"Text": "Invalid keys lie outside the animation ranges; no repair anchors can be determined."
					},
					"Key": "RepairOutsideRange"
				},
				{
					"Source": {
						"Text": "Invalid morph delta."
					},
					"Translation": {
						"Text": "Invalid morph delta."
					},
					"Key": "PskInvalidMorph"
				},
				{
					"Source": {
						"Text": "Invalid or truncated chunk {0}."
					},
					"Translation": {
						"Text": "Invalid or truncated chunk {0}."
					},
					"Key": "PskInvalidChunk"
				},
				{
					"Source": {
						"Text": "Invalid skin weight or bone/point index."
					},
					"Translation": {
						"Text": "Invalid skin weight or bone/point index."
					},
					"Key": "PskInvalidWeight"
				},
				{
					"Source": {
						"Text": "Invalid wedge point index or UV."
					},
					"Translation": {
						"Text": "Invalid wedge point index or UV."
					},
					"Key": "PskInvalidWedge"
				},
				{
					"Source": {
						"Text": "Missing ACTRHEAD signature."
					},
					"Translation": {
						"Text": "Missing ACTRHEAD signature."
					},
					"Key": "PskMissingSignature"
				},
				{
					"Source": {
						"Text": "Missing points, wedges, faces or materials."
					},
					"Translation": {
						"Text": "Missing points, wedges, faces or materials."
					},
					"Key": "PskMissingData"
				},
				{
					"Source": {
						"Text": "Morph data count mismatch."
					},
					"Translation": {
						"Text": "Morph data count mismatch."
					},
					"Key": "PskMorphCount"
				},
				{
					"Source": {
						"Text": "Negative morph vertex count."
					},
					"Translation": {
						"Text": "Negative morph vertex count."
					},
					"Key": "PskNegativeMorphCount"
				},
				{
					"Source": {
						"Text": "No PSA files selected"
					},
					"Translation": {
						"Text": "No PSA files selected"
					},
					"Key": "NoFiles"
				},
				{
					"Source": {
						"Text": "No entries match the current filters ({0} total)."
					},
					"Translation": {
						"Text": "No entries match the current filters ({0} total)."
					},
					"Key": "NoVisibleLog"
				},
				{
					"Source": {
						"Text": "No import log yet."
					},
					"Translation": {
						"Text": "No import log yet."
					},
					"Key": "NoLog"
				},
				{
					"Source": {
						"Text": "Non-finite UV."
					},
					"Translation": {
						"Text": "Non-finite UV."
					},
					"Key": "PskNonFiniteUV"
				},
				{
					"Source": {
						"Text": "Non-finite normal."
					},
					"Translation": {
						"Text": "Non-finite normal."
					},
					"Key": "PskNonFiniteNormal"
				},
				{
					"Source": {
						"Text": "Non-finite vertex position."
					},
					"Translation": {
						"Text": "Non-finite vertex position."
					},
					"Key": "PskNonFinitePosition"
				},
				{
					"Source": {
						"Text": "Normal or color count does not match points or wedges."
					},
					"Translation": {
						"Text": "Normal or color count does not match points or wedges."
					},
					"Key": "PskAttributeCount"
				},
				{
					"Source": {
						"Text": "Not enough bones with matching names were found."
					},
					"Translation": {
						"Text": "Not enough bones with matching names were found."
					},
					"Key": "InsufficientMatches"
				},
				{
					"Source": {
						"Text": "Open the PSA importer to select a skeletal mesh and import animations."
					},
					"Translation": {
						"Text": "Open the PSA importer to select a skeletal mesh and import animations."
					},
					"Key": "ToolbarTooltip"
				},
				{
					"Source": {
						"Text": "Orientation: {0}."
					},
					"Translation": {
						"Text": "Orientation: {0}."
					},
					"Key": "OrientationSummary"
				},
				{
					"Source": {
						"Text": "Overlapping animation ranges produce conflicting repairs. Export and import each animation separately."
					},
					"Translation": {
						"Text": "Overlapping animation ranges produce conflicting repairs. Export and import each animation separately."
					},
					"Key": "RepairOverlap"
				},
				{
					"Source": {
						"Text": "PSA Animation"
					},
					"Translation": {
						"Text": "PSA Animation"
					},
					"Key": "ToolbarLabel"
				},
				{
					"Source": {
						"Text": "PSA chunk {0} has an invalid size or is truncated."
					},
					"Translation": {
						"Text": "PSA chunk {0} has an invalid size or is truncated."
					},
					"Key": "PsaInvalidChunk"
				},
				{
					"Source": {
						"Text": "PSA does not include UE notifies, curves, or complete additive settings. Animations are imported as sampled poses."
					},
					"Translation": {
						"Text": "PSA does not include UE notifies, curves, or complete additive settings. Animations are imported as sampled poses."
					},
					"Key": "SampledPosesNote"
				},
				{
					"Source": {
						"Text": "PSK / PSKX Import Orientation"
					},
					"Translation": {
						"Text": "PSK / PSKX Import Orientation"
					},
					"Key": "MeshPanelTitle"
				},
				{
					"Source": {
						"Text": "PSKX detected as {0}, but the existing asset type is {1}. Import with a new name or folder."
					},
					"Translation": {
						"Text": "PSKX detected as {0}, but the existing asset type is {1}. Import with a new name or folder."
					},
					"Key": "PskxTypeMismatch"
				},
				{
					"Source": {
						"Text": "Partial-skeleton or compressed PSA data is not supported."
					},
					"Translation": {
						"Text": "Partial-skeleton or compressed PSA data is not supported."
					},
					"Key": "PsaUnsupportedData"
				},
				{
					"Source": {
						"Text": "Read {0}: {1} points, {2} triangles, {3} bones, {4} UV channels"
					},
					"Translation": {
						"Text": "Read {0}: {1} points, {2} triangles, {3} bones, {4} UV channels"
					},
					"Key": "PskReadSummary"
				},
				{
					"Source": {
						"Text": "Remaining files canceled."
					},
					"Translation": {
						"Text": "Remaining files canceled."
					},
					"Key": "RemainingCanceled"
				},
				{
					"Source": {
						"Text": "Repaired {0} bone keys ({1} interpolated, {2} copied at the ends); repaired poses are estimates."
					},
					"Translation": {
						"Text": "Repaired {0} bone keys ({1} interpolated, {2} copied at the ends); repaired poses are estimates."
					},
					"Key": "RepairedKeys"
				},
				{
					"Source": {
						"Text": "Select a Skeletal Mesh that has a Skeleton."
					},
					"Translation": {
						"Text": "Select a Skeletal Mesh that has a Skeleton."
					},
					"Key": "MissingTargetSkeleton"
				},
				{
					"Source": {
						"Text": "Select a skeletal mesh imported from PSK or FBX, then choose PSA animations."
					},
					"Translation": {
						"Text": "Select a skeletal mesh imported from PSK or FBX, then choose PSA animations."
					},
					"Key": "PanelIntroduction"
				},
				{
					"Source": {
						"Text": "Show Imported Assets"
					},
					"Translation": {
						"Text": "Show Imported Assets"
					},
					"Key": "ShowResults"
				},
				{
					"Source": {
						"Text": "Show log:"
					},
					"Translation": {
						"Text": "Show log:"
					},
					"Key": "ShowLog"
				},
				{
					"Source": {
						"Text": "Show or hide this log level. Hiding entries does not discard them. The number is the entry count for this import."
					},
					"Translation": {
						"Text": "Show or hide this log level. Hiding entries does not discard them. The number is the entry count for this import."
					},
					"Key": "LogFilterTooltip"
				},
				{
					"Source": {
						"Text": "Source {0} → UE {1}"
					},
					"Translation": {
						"Text": "Source {0} → UE {1}"
					},
					"Key": "OrientationDescription"
				},
				{
					"Source": {
						"Text": "Source: {0} {1}."
					},
					"Translation": {
						"Text": "Source: {0} {1}."
					},
					"Key": "SourceSummary"
				},
				{
					"Source": {
						"Text": "Success"
					},
					"Translation": {
						"Text": "Success"
					},
					"Key": "LogSuccess"
				},
				{
					"Source": {
						"Text": "The PSA animation bone count, frame range, or frame rate is invalid."
					},
					"Translation": {
						"Text": "The PSA animation bone count, frame range, or frame rate is invalid."
					},
					"Key": "PsaInvalidSequence"
				},
				{
					"Source": {
						"Text": "The PSA chunk header is truncated."
					},
					"Translation": {
						"Text": "The PSA chunk header is truncated."
					},
					"Key": "PsaTruncatedHeader"
				},
				{
					"Source": {
						"Text": "The PSA contains duplicate chunks."
					},
					"Translation": {
						"Text": "The PSA contains duplicate chunks."
					},
					"Key": "PsaDuplicateChunk"
				},
				{
					"Source": {
						"Text": "The PSA has duplicate or empty bone names, or an invalid hierarchy."
					},
					"Translation": {
						"Text": "The PSA has duplicate or empty bone names, or an invalid hierarchy."
					},
					"Key": "PsaInvalidHierarchy"
				},
				{
					"Source": {
						"Text": "The PSA is missing bones, animation information, or keys."
					},
					"Translation": {
						"Text": "The PSA is missing bones, animation information, or keys."
					},
					"Key": "PsaMissingData"
				},
				{
					"Source": {
						"Text": "The PSA scale key count does not match the animation key count."
					},
					"Translation": {
						"Text": "The PSA scale key count does not match the animation key count."
					},
					"Key": "PsaScaleCountMismatch"
				},
				{
					"Source": {
						"Text": "The animation contains an invalid scale key time. Export it again."
					},
					"Translation": {
						"Text": "The animation contains an invalid scale key time. Export it again."
					},
					"Key": "PsaInvalidScaleTime"
				},
				{
					"Source": {
						"Text": "The animation contains invalid scale values. Enable \"Repair Invalid Keys\" to attempt repair, or export it again."
					},
					"Translation": {
						"Text": "The animation contains invalid scale values. Enable \"Repair Invalid Keys\" to attempt repair, or export it again."
					},
					"Key": "PsaInvalidScale"
				},
				{
					"Source": {
						"Text": "The animation was created but could not be saved. Check the output folder and save manually: {0}"
					},
					"Translation": {
						"Text": "The animation was created but could not be saved. Check the output folder and save manually: {0}"
					},
					"Key": "SaveAnimationFailed"
				},
				{
					"Source": {
						"Text": "The existing asset type or Skeleton does not match; not overwritten: {0}"
					},
					"Translation": {
						"Text": "The existing asset type or Skeleton does not match; not overwritten: {0}"
					},
					"Key": "ExistingAssetMismatch"
				},
				{
					"Source": {
						"Text": "The target mesh and PSA root bone names differ. Select the matching mesh."
					},
					"Translation": {
						"Text": "The target mesh and PSA root bone names differ. Select the matching mesh."
					},
					"Key": "RootMismatch"
				},
				{
					"Source": {
						"Text": "This PSA uses a UEViewer placeholder hierarchy. Bones are matched by name using the target mesh hierarchy; select the corresponding character mesh."
					},
					"Translation": {
						"Text": "This PSA uses a UEViewer placeholder hierarchy. Bones are matched by name using the target mesh hierarchy; select the corresponding character mesh."
					},
					"Key": "UEViewerHierarchyWarning"
				},
				{
					"Source": {
						"Text": "Translation scale must be a finite number greater than zero."
					},
					"Translation": {
						"Text": "Translation scale must be a finite number greater than zero."
					},
					"Key": "InvalidTranslationScale"
				},
				{
					"Source": {
						"Text": "Truncated chunk header."
					},
					"Translation": {
						"Text": "Truncated chunk header."
					},
					"Key": "PskTruncatedHeader"
				},
				{
					"Source": {
						"Text": "UE could not write animation tracks: {0}"
					},
					"Translation": {
						"Text": "UE could not write animation tracks: {0}"
					},
					"Key": "WriteTracksFailed"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "Unknown"
					},
					"Key": "UnknownAxis"
				},
				{
					"Source": {
						"Text": "Unsupported extra UV channel (maximum total is 8)."
					},
					"Translation": {
						"Text": "Unsupported extra UV channel (maximum total is 8)."
					},
					"Key": "PskExtraUVLimit"
				},
				{
					"Source": {
						"Text": "Use the same source and target forward directions for all body, hair, and clothing parts. Meshes, normals, morphs, and bones rotate together; PSA animations inherit the target mesh settings.\nAfter changing an existing mesh orientation, import its PSA animations again."
					},
					"Translation": {
						"Text": "Use the same source and target forward directions for all body, hair, and clothing parts. Meshes, normals, morphs, and bones rotate together; PSA animations inherit the target mesh settings.\nAfter changing an existing mesh orientation, import its PSA animations again."
					},
					"Key": "MeshOrientationNote"
				},
				{
					"Source": {
						"Text": "Using mesh reference scale: PSA animation scale effects are ignored; position and rotation are imported normally."
					},
					"Translation": {
						"Text": "Using mesh reference scale: PSA animation scale effects are ignored; position and rotation are imported normally."
					},
					"Key": "UseReferenceScaleWarning"
				},
				{
					"Source": {
						"Text": "Valid key values exceed the repair calculation range. Export the animation again."
					},
					"Translation": {
						"Text": "Valid key values exceed the repair calculation range. Export the animation again."
					},
					"Key": "RepairOverflow"
				},
				{
					"Source": {
						"Text": "Warning"
					},
					"Translation": {
						"Text": "Warning"
					},
					"Key": "LogWarning"
				},
				{
					"Source": {
						"Text": "{0} (PSA parent: {1}; target parent: {2})"
					},
					"Translation": {
						"Text": "{0} (PSA parent: {1}; target parent: {2})"
					},
					"Key": "ParentMismatch"
				},
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0} ({1})"
					},
					"Key": "LogFilterCount"
				},
				{
					"Source": {
						"Text": "{0} PSA files selected"
					},
					"Translation": {
						"Text": "{0} PSA files selected"
					},
					"Key": "SelectedFiles"
				},
				{
					"Source": {
						"Text": "{0} record size should be {1}; found {2}."
					},
					"Translation": {
						"Text": "{0} record size should be {1}; found {2}."
					},
					"Key": "PsaRecordSize"
				},
				{
					"Source": {
						"Text": "{0} target bones have no animation tracks and keep their reference pose."
					},
					"Translation": {
						"Text": "{0} target bones have no animation tracks and keep their reference pose."
					},
					"Key": "MissingTargetTracks"
				},
				{
					"Source": {
						"Text": "{0} {1} files succeeded, {2} failed; {3} animations created.\nDestination: {4}"
					},
					"Translation": {
						"Text": "{0} {1} files succeeded, {2} failed; {3} animations created.\nDestination: {4}"
					},
					"Key": "BatchSummary"
				},
				{
					"Source": {
						"Text": "{0}: import was incomplete; {1} animations were created. Check the results and save status."
					},
					"Translation": {
						"Text": "{0}: import was incomplete; {1} animations were created. Check the results and save status."
					},
					"Key": "PartialImport"
				},
				{
					"Source": {
						"Text": "{0}: {1} animations; matched {2}/{3} target bones."
					},
					"Translation": {
						"Text": "{0}: {1} animations; matched {2}/{3} target bones."
					},
					"Key": "FileSummary"
				}
			]
		}
	]
}